Documents/TraceyLinuxIntro.tex
% Created 2024-06-21 Fri 13:47
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{placeins}
\usepackage{gensymb}
\author{Christian Johnson}
\date{\today}
\title{Tracey's Introduction to Linux and Programming}
\hypersetup{
 pdfauthor={Christian Johnson},
 pdftitle={Tracey's Introduction to Linux and Programming},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\newpage

\section{Lesson 1 - Introduction to Linux}
\label{sec:org7c9f419}
Linux is an open-source operating system kernel initially developed by Linus Torvalds in 1991. It is the foundation of numerous operating systems known as Linux distributions.

This section will introduce you to some high level concepts that are important to understanding what Linux is.

\subsection{Kernels}
\label{sec:org5649b0a}
A kernel is the core component of an operating system. It manages system resources, such as CPU, memory, and peripherals, and provides services for applications. It acts as a bridge between software and hardware. It is not necessary to understand how a kernel works, it's simply important to recognize that the kernel exists to translate code and software instructions to hardware. 

Linux itself if \emph{not} an operating system - it is only a \hyperref[sec:org5649b0a]{Kernel}. The operating system commonly referred to as "Linux" should actually be called "GNU + Linux". GNU here refers to a collection of open source tools and programs that work with the Linux kernel to create a functioning operating system. That is what all operating systems that are considered part of the "Linux" family \emph{are} - the Linux kernel packaged with a collection of software that works together to create a functioning product.

There are many operating systems that are not considered to be "Linux" (Windows is the most notable example). This is because they do not use the Linux Kernel. Other kernels include the Windows Kernel, Darwin (Apple's proprietary implementation that is run on Max), BSD (An alternative to linux), and several others. The kernel is the most integral part of an operating system - if an OS uses the "Linux" kernel, it's considered Linux. If someone pirated the Windows kernel and made a new OS with it, that OS would technically be "Windows".

\href{https://www.geeksforgeeks.org/kernel-in-operating-system/}{What is a kernel?}
\href{https://www.baeldung.com/cs/os-kernel}{Kernels in Computer Science}

\subsection{Distributions}
\label{sec:org615b51f}
A Linux distribution, often called a distro, is a complete operating system built around the Linux kernel. It includes the kernel itself, system libraries, utilities, and software applications. There are \textbf{many} different distributions, but some of the most notable ones include \emph{Ubuntu}, \emph{Debian}, \emph{Arch Linux}, and \emph{Fedora}.

\subsubsection{What are the differences between distributions?}
\label{sec:org6ef867c}
Differences between distributions primarily stem from:
\begin{itemize}
\item \textbf{\textbf{Package Management:}} Every distribution uses a specific package manager to install, update, and remove software. This is fundamentally just a piece of code written to search internet databases for code files, download them, install them to the correct place on your hard drive, and perform setup steps to ensure that the operating system recognizes the newly installed software. Different distributions will use different package managers as a default, but it is possible to use alternate package managers in many cases.
\item \textbf{\textbf{Default Software:}} Distributions vary in the selection of pre-installed software. When I say "pre-installed software", I am referring to the programs that make the operating system function, not user level applications. This is the "GNU" of "GNU + Linux". This default software includes collections of drivers, compatibility layers, libraries, and many other pieces of low level code that act as a "black-box" for basic system functions.
\item \textbf{\textbf{Philosophy and Target Audience:}} Some distributions focus on stability, while others prioritize cutting-edge software. The most popular operating systems are those that were created to solve a problem or address a complaint. For example, \textbf{Arch Linux} exists to present its users with the newest and most cutting edge code available. As soon as a developer releases code (whether it works or not) it is available to be installed using Arch Linux's package manager. \textbf{Debian} on the other hand, specifically exists to be stable and usable long term with minimal effort. The maintainers for Debians package manager take years to vet, test, and review packages before they are available for download. \textbf{Kali Linux} is another example. It is based on \textbf{Arch}, but it was not created out of any interest in package availability. Kali Linux was created specifically to present an environment with all the necessary tools and setup to PenTest networks (Hack into things).
\end{itemize}

Each distribution has its own community and support channels, influencing user experience and assistance available. Much of the advice that applies to one distribution will apply to others however. This is the beauty of Linux - Arch Linux and Debian (for example) are not alien universes to each other. They use different package managers, and have very different outlooks on the freedom that their users should be allowed, but at the end of the day much of the same code that makes Arch run is also present in Debian. 

\href{https://www.geeksforgeeks.org/what-are-linux-distributions/}{What is a Distro?}
\href{https://itsfoss.com/what-is-linux/}{Why are there so many Distros?}
\href{https://en.wikipedia.org/wiki/Comparison\_of\_Linux\_distributions}{Linux Distro Comparison}
\href{https://www.redhat.com/en/topics/linux/whats-the-best-linux-distro-for-you}{Red Hat - Choosing a Linux Distro}

\subsubsection{What is a desktop environment?}
\label{sec:org9fbb467}
A \textbf{Desktop Environment} or \textbf{Window Manager} is essentially what turns your computer from "Terminal Only" to "Pictures and Pretty Things".

A window manager is a program that sets up a graphical interface, and allows seperate programs to run as "windows" inside of that interface. It applies rules to those windows, limiting their behavior and the degree to which the user can interact with them.

A desktop environment is a graphical interface designed to provide a consistent and user-friendly experience on Linux. Examples include GNOME, KDE Plasma, Xfce, and Cinnamon. It includes a window manager, icons, toolbars, and integrated applications (file manager, text editor, etc.).

A desktop environment provides the typical "Windows" experience - i.e., everything is provided. When you use a desktop environment, you install a large number of programs, but those programs are preconfigured to work together and present a cohesive interface. It is possible to install \emph{only} the window manager, for a more minimal experience (This is what I do). The window manager will provide \emph{only} the ability to "manage windows" (programs will open in a window, and the user is able to move them around, adjust how they look, and setup rules based on what that window is running), but the specific functionality and syntax varied based on the window manager itself.

\href{https://itsfoss.com/what-is-desktop-environment/}{What is a Desktop Environment?}
\href{https://wiki.archlinux.org/title/Desktop\_environment}{Arch Wiki - Desktop Environments}
\href{https://www.techopedia.com/definition/10043/window-manager}{What is a Window Manager?}
\href{https://www.howtogeek.com/1119/what-is-dwmexe-and-why-is-it-running/}{Window's Window Manager}

\subsection{Lesson 1 - Key Terms}
\label{sec:org5beaa20}
\begin{itemize}
\item \hyperref[sec:org5649b0a]{Kernel}
\item \hyperref[sec:org615b51f]{Distribution}
\item \hyperref[sec:org6ef867c]{Package Manager}
\item \hyperref[sec:org9fbb467]{Window Manager}
\item \hyperref[sec:org9fbb467]{Desktop Environment}
\end{itemize}
\end{document}
